// ДЗ_2.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>

//---------------------------------------------------------------
//-|1|-----------------------------------------------------------
//---------------------------------------------------------------

short int tree = 100;
int grass = 20'000;
long long flower = 2'008'864'836;
char cChar = 'G';
bool leaf = false;
float room = 7.876;
double hall = 8.54676375;

//---------------------------------------------------------------
//-|2|-----------------------------------------------------------
//---------------------------------------------------------------

enum TicTacTicTac
{
	TT_EMPTY = '-',
	TT_CROSS = 'X',
	TT_ZERO = '0'
};

//---------------------------------------------------------------
//-|3|-----------------------------------------------------------
//---------------------------------------------------------------

TicTacTicTac array[3][3] = { {TT_EMPTY, TT_EMPTY, TT_EMPTY},
							 {TT_EMPTY, TT_EMPTY, TT_EMPTY},
							 {TT_EMPTY, TT_EMPTY, TT_EMPTY} };

//---------------------------------------------------------------
//-|4|-----------------------------------------------------------
//---------------------------------------------------------------

struct TicTacTic
{
	TicTacTicTac array[3][3];
	bool isGameFinished;
	bool isFirstPlayerWon;
	long long Human1ID, Human2ID;
	TicTacTicTac eHuman1, eHuman2;
	const unsigned int nFieldSize = 3;
};